app/controllers/stream_controller.rb

SELECT  "songs"."id", "songs"."name", "songs"."mp3" FROM "songs"   ORDER BY "songs"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "songs"
---
  def jazz
    @songs = Song.select("id", "name", "mp3").offset(rand(Song.count)).first